In [2]:
# 데이터 준비하기
import pandas as pd
df=pd.read_csv("data/titanic.csv")
df=df[["Survived","Pclass","Sex","Age","Embarked"]]
df=df.dropna()
df.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [3]:
len(df)

1044

In [4]:
# 객실등급별 생존자수
df1 = df.groupby("Pclass").Survived.count().to_frame()
df1

        Survived
Pclass
1            282
2            261
3            501

In [5]:
df2 = df.groupby("Pclass").Survived.sum().to_frame()
df2

        Survived
Pclass
1            168
2            112
3            135

In [6]:
# 객실등급별 생존율
df3=df.groupby("Pclass").Survived.mean().to_frame()
df3

        Survived
Pclass
1       0.595745
2       0.429119
3       0.269461

In [7]:
df4=pd.concat([df1,df2,df3],axis=1)
df4.columns=['승선자수','생존자수','생존율']
df4

        승선자수  생존자수       생존율
Pclass
1        282   168  0.595745
2        261   112  0.429119
3        501   135  0.269461

In [8]:
# 성별 승선자수
df5 = df.groupby("Sex").Survived.count().to_frame()
df5

        Survived
Sex
female       386
male         658

In [9]:
# 성별 생존자수
df6=df.groupby("Sex").Survived.sum().to_frame()
df6

        Survived
Sex
female       322
male          93

In [10]:
# 성별 생존율
df7=df.groupby("Sex").Survived.mean().to_frame()
df7

        Survived
Sex
female  0.834197
male    0.141337

In [11]:
df8=pd.concat([df5,df6,df7],axis=1)
df8.columns=['승선자수','생존자수','생존율']
df8

        승선자수  생존자수       생존율
Sex
female   386   322  0.834197
male     658    93  0.141337

In [12]:
# 성별, 객실등급별 생존통계
df.groupby(["Sex","Pclass"]).Survived.mean()

Sex     Pclass
female  1         0.977099
        2         0.941748
        3         0.638158
male    1         0.264901
        2         0.094937
        3         0.108883
Name: Survived, dtype: float64

In [14]:
def my_mean(values):
    return sum(values)/len(values)

In [15]:
df.groupby(['Sex',"Pclass"]).Survived.agg(my_mean)

Sex     Pclass
female  1         0.977099
        2         0.941748
        3         0.638158
male    1         0.264901
        2         0.094937
        3         0.108883
Name: Survived, dtype: float64

In [16]:
# 데이터 준비
df20 = df[:20]
df20.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [17]:
len(df20)

20

In [18]:
# Pclass 그룹별 인덱스
df20.groupby("Pclass").groups

{1: [1, 3, 6, 11], 2: [9, 15, 20, 21], 3: [0, 2, 4, 7, 8, 10, 12, 13, 14, 16, 18, 22]}

In [19]:
# pclass 그룹 출석 1등석
df20.groupby("Pclass").get_group(1)

    Survived  Pclass     Sex   Age Embarked
1          1       1  female  38.0        C
3          1       1  female  35.0        S
6          0       1    male  54.0        S
11         1       1  female  58.0        S

In [20]:
# pclass 그룹 출석 2등석
df20.groupby("Pclass").get_group(2)

    Survived  Pclass     Sex   Age Embarked
9          1       2  female  14.0        C
15         1       2  female  55.0        S
20         0       2    male  35.0        S
21         1       2    male  34.0        S

In [21]:
# pclass 그룹 출석 3등석
df20.groupby("Pclass").get_group(3)

    Survived  Pclass     Sex   Age Embarked
0          0       3    male  22.0        S
2          1       3  female  26.0        S
4          0       3    male  35.0        S
7          0       3    male   2.0        S
8          1       3  female  27.0        S
10         1       3  female   4.0        S
12         0       3    male  20.0        S
13         0       3    male  39.0        S
14         0       3  female  14.0        S
16         0       3    male   2.0        Q
18         0       3  female  31.0        S
22         1       3  female  15.0        Q